---
kind: method
id: M:Autodesk.Revit.DB.ParameterValue.Copy
zh: 复制
source: html/d2c6a380-8e4f-42fa-f698-77181259b347.htm
---
# Autodesk.Revit.DB.ParameterValue.Copy Method

**中文**: 复制

Makes an identical copy of the given parameter value.

## Syntax (C#)
```csharp
public ParameterValue Copy()
```